IDEA Open Model
ConProjectInfo Class
Compatible with IDEA StatiCa 20.1
 Provides informationabout
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.ConProjectInfo
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class ConProjectInfo
Public Class ConProjectInfo
The ConProjectInfo type exposes the following members.
Constructors
Name | Description
ConProjectInfo
Initializes a new instance of the ConProjectInfo class
Top
Properties
Name | Description
Author
 Name of the author
Connections
 Connections in the project
Date
 Date
Description
 The description of the project
DesignCode
 Design code
Name
 The name of the project
ProjectNumber
 Project number
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace